{
  "172": ["What did the group discuss about the function of rolling through the user's favourite channels?", "What did the group discuss about the object of the remote control?", "What did the group discuss about the functional Remote control?", "What function did the group think should be on the remote control?", "What did the group discuss about the functions of the remote control?", "How did they discuss the kinetic function of the remote control?"],
  "36": [
    "What is the appearance of the remote?",
    "What did the Project Manager elaborate on the members when discussing the materials of the television remote?",
    "What did the group talk about the appearance of the television remote?",
    "Why did the team discuss the desired features of the new TV remote controls?"
  ],
  "50": [
    "Summarize the discussion about the name chosen of the product.",
    "Summarize the decision of the discussion on the name chosen of the product.",
    "Summarize the group's decision on colour and logo of the product."
  ],
  "35": [
    "Summarize the product evaluation that was during the project evaluation.",
    "Summarize the discussion about product evaluation.",
    "Summarize the discussion about product evaluation."
  ],
  "150": [
    "What did the group discuss about the detailed design of the product?",
    "What did the group determine on the evaluation criteria of the detailed design?"
  ],
  "136": [
    "What did the group think of the leadership in the process of the project?",
    "What was the feedback for leadership, teamwork and means used during the pro evaluation?",
    "What did User Interface think of the evaluation of the team's leadership when discussing the process of the project?"
  ],
  "140": [
    "Summarize the discussion of the design of actual components regarding case material.",
    "Summarize the discussion of the design of actual components regarding interface design.",
    "Summarize the design and availability of actual components."
  ],
  "158": [
    "What ideas did User Interface suggest when discussing market research and related adjustments?",
    "What ideas did Industrial Designer suggest when discussing market research and related adjustments?",
    "Why did Industrial Designer think of incorporating an alarm when discussing market research and adjustments due to new project requirements?",
    "Why did Industrial Designer think of physically different designs when discussing market research and adjustments due to new project requirements?"
  ],
  "0": [
    "Summarize the group's discussion about technical and functional designs of the remote control?",
    "Summarize the discussion about the propotype presentation about the buttons and main features the remote control.",
    "Summarize the discussion about detailed design of the remote control.",
    "Summarize the discussion of specific designing requirements of the new remote control."
  ],
  "161": [
    "What did the Industrial Designer and the Project Manager discuss about the LCD screen?",
    "Why did the other group members disagree with Industrial Designer when talking about the LCD display?",
    "Why did User Interface disagree with Industrial Designer when talking about having the screen on the television screen?",
    "Why did group mates disagree with Industrial Designer when discussing whether they lost their evaluation criteria?"
  ],
  "139": [
    "What did User Interface introduce about the detailed design of the prototype?",
    "What features did User Interface present regarding the design of the prototype?",
    "What were the advantages of the design for the prototype?"
  ],
  "105": [
    "What did Industrial Designer think about the ten digits when discussing interface design of remote control?",
    "What did Industrial Designer and Project Manager think of the remote tracking method when discussing the designing requirements of the new remote control?",
    "What did Industrial Designer think about remote control style?"
  ],
  "182": [
    "Why did the group decide to incorporate a menu display when discussing remote control style and design optimization?",
    "What's the decision of buttons size and scale design when discussing the design of the remote control?",
    "What did the team talk about button design of the remote control?",
    "What did the group discussed about the fluorescent button on the remote control?",
    "Summarise the discussion about grouping buttons on the remote control."
  ],
  "130": [
    "Why did Industrial Designer think rubber casing was the best when talking about the options for materials?",
    "What did the team discuss about the use of advanced chips and LCD display?",
    "What did the user interface designer recommend when discussing the casing material of the product and why?"
  ],
  "93": [
    "How did Project Manager think of the cost of adding rechargeable units to the device when discussing extra designs or gadgets to make the remote control special?",
    "What's Industrial Designer's concern about the idea of adding rechargeable units to the device during discussion on extra designs or gadgets to make the remote control special?",
    "What did the team think of a rechargeable remote when discussing remote control's functional design and production cost?"
  ],
  "4": [
    "Why did the Project Manager agree with Marketing when discussing his personal ideas towards the design?",
    "Why did Project Manager propose that the product should be international when discussing the product features?",
    "Why did Project Manager say that money was an important part of the project?"
  ],
  "118": [
    "Summarize the discussion of group warming and the introduction to the new remote control project.",
    "Summarize the group discussion about remote control concept decisions.",
    "What decision did the group make on universal remote?",
    "Summarize the decision discussion about parental control, the games, and voice recognition."
  ],
  "199": [
    "How Did Project Manager and User Interface introduce the prototype of the remote control?",
    "How did the group hold their views towards multi-functional and single-functional product?",
    "Why did they give lower grades when discussing the technological aspect?",
    "Why did the group think of the locator when presenting the functional requirements?",
    "How did Industrial Designer introduce the two prototypes of the remote control?"
  ],
  "8": [
    "Summarize the Project Manager's perspective on the prototype.",
    "Summarize the team's evaluation of the prototype.",
    "Summarize the team's evaluation of the process of the project.",
    "Summarize the evaluation process on the prototype.",
    "What's the final evaluation of the project?",
    "Summarize the evaluation of the marketing expert on the prototype using the past user requirements and trends analysis."
  ],
  "157": [
    "Why did the group give up the idea of positioning symmetrical buttons on both the left and right side?",
    "What did the team think of Project Manager's suggestion of making a right- and left-handed remote during the presentation of the prototype?"
  ]
}