{
  "172": ["According to the user interface designer, to implement this function, the users should press a button to start the program and type in their favourite channels. The project manager liked this idea and the marketing thought it would be another great market tool. In terms of the cost, the project manager believed it wouldn't be too expensive because they could come up with a partnership to produce that quite cheaply, but the marketing held that the technology was available through their own service. Furthermore, this function must be accompanied by a mode switch and an indicator.","Marketing thought they should design a remote control for television only due to the issue of advancement. User Interface supposed that it would be nice to have playing and recording and stop buttons on remote controls for the video recorder as well, but he didn't know if that worked technologically. Industrial Designer agreed to define the object of remote control, and he proposed that it would be simpler if it's just for television because there were fewer buttons, which would benefit older people or people that weren't very co-ordinated hand-eye.","Industrial Designer expressed initial working design about remote control. User Interface suggested that remote control should be user friendly with not too much but clear buttons. Marketing showed us data about functional requirement remote control. Project Manager said that the new requirement about remote control was teletext should be paid less attention as it was outdated. Future customers' age should be focused on forty plus and new design should include corporate colour and slogan.","Project Manager said that remote control should only work with TV. Marketing thought the basics should be volume, channel and one till two zero numbers. Users Interface suggested remote control should with a button you can change from one number to two numbers.","The User Interface proposed to build a stand-alone one, which can be different from any other devices. The Project Manager then added that it might be better with more useful functions like changing the faces. Marketing came up with the idea of making it be functional for other devices as well, just including everything in this remote control.","The project manager wanted to remove the kinetic function as the manager thought it would be a desirable cost reduction. However, the industrial designer did not agree with the project manager because the designer thought it would be a good marketing promotion as people would think that remote controls with kinetic function are cool. Since they still wanted the price to remain on the same level, they decided to adapt the control into a flat one so as to minimize the cost."],
  "36": [
    "The corporate colour and design are recommended to be used on the product. The remote could be in different colours such as pink or banana yellow and shapes such as a fun shape like animal shapes or a comfortable shape that fits the hand but no sharp projections, lest a child plays with it. The idea of buttons with various shapes such as a triangle for volume and square for channels was considered. Everyone agreed that the text on the remote should be clear and the remote should be compact.",
    "The group talked about the material and they found it would be hard to balance the budget and the quality. In order to save the cost and ensure satisfying user experience, the Project Manager decided to choose high-quality recycled plastic as the material. But in terms of the battery, he would pay a lot to equip the remote with a cutting-edge lithium battery.",
    "In terms of putting fashion into the electronics, this is both their slogan and their design target. Apart from the company colour of black and red, the Project Manager came up with the idea of providing skins for the users. But the members were not in favour of this idea for that the work would be huge, at the same time, they were inspired to add the logo on the boot-up screen and introduce a dormant mode because most people do not want the remote to be flashing when the TV is on.",
    "There were two reasons. The first was that the unit price of each remote control was relatively high (twenty-five Euros). Therefore, in order to increase customers' willingness to spend so much money on one single remote control, the features must be satisfying and good enough. The second was the competition since there were other TV remote controls in the market. The new TV remote controls shall be special and different from the rest so as to attract customers."
  ],
  "50": [
    "They drafted several potential product names, including \"banana\", \"RC deluxe\", \"real reactor\", \"triple RC\", etc. They concentrated on adjusting the \"triple RC\", and eventually decided on \"triple R\". The group thought this name was cool, and especially looked cool when it was printed in the front, and it was catchy.",
    "They agreed to cross out 'banana remote', 'the deluxe' from the options. They all agreed on the 'triple R' without arguments, because the group thought it looked cool when it was printed out. In addition, it was short and catchy.",
    "The project manager mentioned that they would love to incorporate the company`s logo and colour into the product design, but it did not necessarily need to be the same colour. Since there was not a plan about which specific colour and logo to use, the industrial designer initiated the colour yellow and it was adopted."
  ],
  "35": [
    "On a scale of one to seven, with one being good and seven being the worst, everyone rated the shape and colour of the remote with a one. The size was given a mark of four by Marketing, a two by Project Manager and the others gave it a one. For the feel, which included texture and comfort, it scored a three with User Interface and a two for the rest. Functionality was given a two by User Interface and Marketing and a three by the other two. All in all, the team was satisfied with the product.",
    "The marketing suggested measuring how good the design was instead of just talking about it so the group started to judge the design in three aspects on a scale of one to seven, one being true and seven being false. The criterion was how fancy, technologically innovative, and easy-to-use the remote control was and it got three, two, and four in separate aspects, which meant it was acceptable.",
    "The marketing thought they needed to evaluate whether it made sense to do the project and whether the product could fulfil their requirement. So the group started to judge the design on a scale of one to seven, one being true and seven being false. The criteria were fanciness, technology, robustness, usefulness, size and weight, colour and shape, and adaptiveness. The product got an average score of two point one seven, which implied it was good."
  ],
  "150": [
    "User Interface presented the function, customizability and appearance (colour, material and shape) of the remote control. Then the group discussed the location of the microphone as well as the weight and shape of the buttons. Project Manager suggested that the microphone should be under the flip while User Interface argued that it should be on the side. User Interface also proposed that the buttons should be made in egg shape and of plasticine.",
    "Industrial Designer proposed to specify the location of the microphone. Project Manager and User Interface disagreed with each other. Project Manager thought the microphone should be under the flip so that users could easily turn off the voice recognition, whereas User Interface insisted that microphone should be on the side so that the remote control could be activated by voice even when out of reach."
  ],
  "136": [
    "Project Manager thought his leadership was crap personally and he never did a management position. While Industrial Designer thought Project Manager did tell them when to start and when to end, which was important in good leadership. And User Interface thought Project Manager did a good job in leadership because they didn't have set roles so much, which was a democratic process. Marketing supplemented that everyone got blended quite well.",
    "Marketing, User Interface and Industrial Designer thought Project Manager did a good job. Project Manager believed that the teamwork was great and this opinion was echoed by the other three team members. Whiteboard was used during the meeting but digital pens were not and the team agreed that they could have used the whiteboard a bit more. The team mostly used the slide because it was better positioned.",
    "User Interface thought that the team members can't all fairly comment on leadership because Project Manager is the leader, and the other member's experience of leadership wasn't as much as the Project Manager."
  ],
  "140": [
    "Titanium is too expensive, would be easily dented and could only do a standard box shape whereas plastic could be made into different curved shapes. Marketing suggested making the basic mould out of plastic with a rubber cover, which would give a spongy feel and be a cheap way to change the look of the device. Industrial Designer, User Interface and Project Manager quickly jumped on board with this idea.",
    "The team planned to do touch screen and there are two options to choose from, a bare PCB circuit board which could be in different colours and making a connection by the touch of fingers, and anti RSI rubber buttons with a LCD type of screen. Industrial Designer doubted whether a LCD screen is wanted as it would only be in black and white but have not thought out how to distinguish where to press if the bare PCB circuit board is used.",
    "The chip TA11835 and PCB board will be used in the device. The use of kinetic charging was agreed by the team with a standby mode to save battery. The case of the device would be in plastic and would have a changeable rubber cover. LCD screens will be adopted. The idea of adding a stylus or a mirror to the device was rejected."
  ],
  "158": [
    "User Interface advocated to adjust to meet the needs of users from the perspective of technical function design. It is mainly user-centred, reducing buttons and making it easier to use. In addition, User Interface suggested that the general remote controller proposed by marketing will increase the budget and button, so the research should be stopped and focused on the remote control's appearance design.",
    "Industrial Designer believed that the basic function of the remote control is to send messages to another system. The remote control needed an energy source to supply power to the integrated circuit, and had a chip and related information to control the infrared lamp. In the design, it can make the battery and infrared lamp cheaper and more sustainable. It can also add the design of speech recognition interface according to the market research provided by Marketing.",
    "The market research implicated that users' biggest frustration was their failure in finding the remote control once it was lost in the house. To solve the problem, Industrial Designer suggested that a button could be added on the TV; when the user pressed the button, the remote control would beep to let the user know its location. Meanwhile, such a solution would be within budget.",
    "Industrial Designer was inspired by the design of Xbox and gave an example of Japanese people's small hands compared to the big controller. Out of ergonomic considerations, Industrial Designer encouraged the team to notice the physical differences among users all over the world when deciding the remote control size."
  ],
  "0": [
    "Marketing believed that an ideal remote control should compress 3-4 different controllers in a thin combination. Users can switch controllers by sliding or flipping. Industrial Designer proposed a two-sided controller and said that he could keep it simple on one side and complicated on the other side.",
    "User Interface first summarized the propotype of the remote control discussed before. The remote control should be curved, easy to hold, nice and small with big buttons. Those buttons were a scroll and some push buttons. The body of the remote control shall be smooth plastic or spongy rubber with yellow and black buttons. The remote control would be comfortable to watch because it had suitable curtature and it's on-off was in the back.",
    "There were two main parts in the detailed design. Firstly, the prototype presentation, Industrial Designer presented the design on the wheel, the button, and the base of the remote control. Secondly, Marketing presented eleven points to be evaluated based on the findings in marketing trend reports and company strategy marketing. Besides, the group had a point calculation on each evaluation criterion.",
    "Given the customer demand and conferees personal experiences, several designing requirements were proposed during the discussion. The remote control was decided to be adaptable to multiple devices with few buttons, be able to be lighted in the dark and held in hand, and be both water-proof and shock-proof along with a whistle tracking system, based on which advantage over competitors might well be gained at the price of a rising production cost."
  ],
  "161": [
    "The User Interface Designer thought it might be in the middle of the product because the way users hold the product wouldn't influence the view to the screen, but the Project Manager and the Marketing thought the screen might be covered when held by hands, so the users couldn't figure out what happened on the screen. Then the Project Manager proposed that it was totally unusable, still needing marketing research.",
    "Industrial Designer wanted an LCD that could be applied to show program information, which was also trendy if colored. However, this idea was disagreed by other group members for the following reasons. First, a big LCD screen was too expensive. Second, most users read the information on TV and the Internet instead of the remote. Next, LCD had a vulnerable feature and was also too functional to match the basic design concept. Moreover, for User Interface suggested that the design required only one specialty, LCD was not that necessary when the group had already decided on the docking station.",
    "User Interface thought it was rather meaningless to put the screen on the television screen. It would be better if they only made a menu with different options through which users can change the settings and find information about programs.",
    "Industrial Designer thought they lost the locator while keeping other features. But Project Manager responded that they were going to have a beeper. User Interface supplemented that it was not like a sample speaker, but it would beep so they still had the locator."
  ],
  "139": [
    "User Interface suggested that the prototype of the remote control would have an ergonomic shape, be made out of wood and the colour would be customisable. User Interface also introduced the general layout of the white board under the flip: the big yellow button would be charged for turning the TV on and off, the red triangle one would be used to change the volume, while the green one controlled the channel changing. There would be a dark blue numeric pad at the bottom and an LCD screen on the flip panel. The prototype would have a customised backing and front.",
    "Features of the remote include signal-emitting LED, on-off switch, mute button, nine channel buttons, two buttons for increasing or decreasing volume, two buttons for scrolling up or down channels and menu button at the centre, which would control the colour, sharpness, brightness etc. Also, there would be an elongated shaped swapping button that was slightly flexible. If it was turned to the left, the TV would change to the previous channel that the user was watching and if to the right, the next channel. The remote has an inbuilt voice recognizer that would recognize the user's voice and act accordingly.",
    "According to the technical specifications given by the industrial designer, the product was very flexible because users could add buttons. Users could use the jog wheel to select whichever option on the LCD and do the power control. There was also an LCD control, so users could switch on the LCD display if they wanted to use LCD and use a normal button if they didn't want to use LCD. What's more, the controller had the functions of speech recognition and location finder."
  ],
  "105": [
    "Industrial Designer thought the ten buttons looked a bit dull so speech recognition could be added to solve this problem. But he was concerned that power saving could be difficult when implementing speech recognition.",
    "Industrial Designer first recommended adding a special beeping button on the TV set to remind users of where the remote controls were, but the plan was deemed impractical concerning TV sets that were not designed by them. Then Project Manager suggested whistle tracking and was approved by all the conferees as an original improvement.",
    "Industrial Designer desired to make the remote with most used buttons so that the remote was friendly to users. Unnecessary buttons should be behind some kind of protection so that they only can be seen when needed. Instead of a big size, the remote control should be the normal size with the least amount of buttons."
  ],
  "182": [
    "Marketing believed that most of the market would want convenient channel browsing and volume adjustment features instead of any tampering or programming with too many buttons. User Interface agreed with the simplification of symbols. The team came up with a menu display to make the remote more user-friendly.",
    "It may require more than three millimetres with three buttons, and since there are not as many buttons, each button should be fully functional so that the basic requirements of the user can be met and the operation can be simple, or at least not too complicated, while they enjoy the function.",
    "Buttons design was all about volume, channel, power, and some other instant ideas. The team discussed their sizes, big or small, and places, up, center, or down, and also their arrangements, vertical or horizontal, and reached a conclusion that the power button could be on top. They came up with mute button as well but Project Manager didn't think it was important.",
    "The group liked the fluorescent idea. The user interface designer suggested that since fluorescent lights lost their brightness after a certain time, the group could make this function tactile. They decided to make this function into little arrows that could be felt. They further debated on whether to use a battery to provide power or to use a naturally fluorescent material.",
    "Marketing first of all suggested focusing on elderly people who really got problems with remote controls and then pointed out the unclear button allocation on remote controls. To solve this problem, Marketing put forward that the remote control buttons should be grouped based on functions they serve. Project Manager agreed."
  ],
  "130": [
    "Industrial Designer indicated rubber was softer than metal, cheaper than titanium that would exceed the budget, and more flexible to color alternatives. Although rubber couldn't work as the interior to protect innards, rubber coating would reduce the impact if the remote control was dropped.",
    "Industrial Designer introduced both simple chips and advanced chips could be used for the mouse. But it would require the use of LCD display, which would highly increase the cost. Project Manager agreed that the LCD was easy when using the scroll buttons and could see the number. But Project Manager argued that young people were less likely to have their own room to afford a LCD TV and decided not to choose the advanced ones.",
    "The user interface designer pointed out that if they were to go with titanium, there would be limitations in the amount of shapes because it was tough to shape the titanium. Also, wood was not suitable as it seemed anti-technology. Thus, the user interface designer recommended making a thick plastic inner shell and a rubber outer shell which was more durable and felt better."
  ],
  "93": [
    "Project Manager believed that money spent on the rechargeable units was necessary because other elements of the remote control were just basic. In addition, Project Manager thought it would not cost much if the product was produced in Taiwan. However, it was acknowledged that cost could probably be a concern so he/ she decided to only do that if the cost was fair.",
    "To Industrial Designer, remote controls could last a long time with two batteries. Therefore, it might not be necessary or attractive enough to customers in his/ her opinion.",
    "Industrial Designer raised an idea of making a rechargeable remote control which could have a wire and could charge itself when it was put in the electricity. Project Manager also had some responsive sparkles but they could hardly be applied. But at least one thing the team all agreed to was that a rechargeable remote was a comfort and people could pay for comfort."
  ],
  "4": [
    "The Marketing proposed to use voice control on the remote and according to his research, three quarters of people under 35 are in favour of voice control. At the same time, in order to keep the remote not so easy to be lost as its counterparts of other brands, voice control would be an essential technique. For those two reasons, the Marketing persuaded the Project Manager to target their consumers as the youth.",
    "Because it would be sold in the entire world and everyone would use it.",
    "User Interface asked a question that whether it would be a stand-alone unit that they are going to be selling. So Project Manager answered that they should decide which kind of remote control they want to go, if it should be a specific remote control to some specific device, or if it should be a universal one. User Interface responded that they need to design the product to fit the expecting twenty-five Euro based on the requirement. Project Manager agreed and invited group mates to input ideas in the next meeting."
  ],
  "118": [
    "Mutual greeting heralded the beginning of the meeting and the goal of the new remote control project was introduced by Project Manager to the conferees as to win over competitive products by being original, trendy and user-friendly. Then Project Manager continued with the introduction of the design process, which was divided into three main parts—functional design, conceptual design and desired design that respectively focused on the user-related technical functions, desirable user interface and different trends involved, and specific implementation and choice-detailing process of conceptual design.",
    "Firstly, the group discussed whether they could have changeable covers of different fruit and vegetable colours. Secondly, they had a discussion on the energy, the case and the chip. Then, group mates decided to have latex in fruity colours, a chip, a menu button to scroll as well as on-off buttons.",
    "When Marketing first touched on the idea of a universal remote, she quickly rebutted herself, arguing that a high-end product was not achievable with a tight budget. However, Project Manager said that the group could make an attempt to provide a basic version of universal control, which could switch between stereo, VC, and TV. Thus, the group agreed to give universal remote a try and see if they could design a cheap one within budget.",
    "Group mates agreed that they could incorporate the parental control as well as the gaming features into the remote control. However, they would discard the idea of voice recognition because it would be too much for the remote feature."
  ],
  "199": [
    "Project Manager introduced that the prototype incorporated fashion trends that people prefer fancy looking products like fruit and vegetable. After That, User Interface presented the product which looked like a banana and was bright yellow except for the blue button. The style was as simple as possible in order to fit the customers' need for simplicity. Also, the product could be curved and used both-handed with advanced chips hidden inside, which seemed quite creative and identical to iPod features. In the end, Industrial Designer commented that the remote control could be smaller in size.",
    "The user interface designer suggested two options of making the remote control functional. One way was to make it multi-functional, so as to be used for several entertainment devices. Another way was to make it single-functional, which could be used specifically for the television. The entire group preferred the product to be single-functional. It is because making an original design was more obtainable, and it would be more profitable as it would be more simplistic. They had to make it compatible with different brands of devices to sell internationally.",
    "For the technologically innovative part, the product was only added with a wheel and the rubber material. In terms of innovation, there still lacked some shining points. Therefore, everyone gave a lower grade compared to other aspects.",
    "When Marketing mentioned about the long battery life, the group came up with the locator that the remote could beep when users clapped. Also, this function should be designed to not beep every five minutes so that users would not like the remote. The group mates agreed on it and thought it was an interesting and excellent idea.",
    "Both the devices had the special shape, like the surf-board. The first prototype was a pretty simple design with LCD display and an on-off button in red. It was easy to use and could only be used for the TV mode. After all, the team concluded that it was a standard design except for its special shape that made it look adorable. On the contrary, the second prototype was advanced in its speech recognition function and looked like a fashion mobile phone. It came with six key buttons and one orange one for the microphone. If the user would like a speech recognition and a lot of information on the channel could be displayed directly on LCD display. Also, the components for the two designs were low in weight and there was LED to indicate the battery usage, making it convenient to use. To conclude, Marketing fancied the second one's size and shape."
  ],
  "8": [
    "The Project Manager thought the prototype was basically the same with the former one, and the thickness was not suitable for the target customers. Then the LCD screen might be covered when held by hands, so the users couldn't figure out what happened on the screen. Therefore from this perspective the screen was totally unusable, still needing marketing research.",
    "The evaluated the prototype against some criteria formulated in response to the market research and financial consideration. The team agreed that the features of fancy appearance and technical innovation were mutually exclusive. Besides, they all believed that their product incorporated elements of fashion to attract buyers and it fit in with their company's other products. Then, the team discussed the budget of the product.",
    "The team thought the creativity of the team was okay, as they felt that they got chances to express themselves well enough, but there were still some problems in their process of discussion. Then, Industrial Designer gave an example on how to improve the creativeness of the team. The team believed that their team work went well. As for the methods of discussion, Project manager thought that he was still not familiar with the operation of computers.",
    "Every team member evaluated the prototype, and the evaluation criteria were user-oriented and market-indicated, which meant the product needed to meet the following standard such as fancy appearance, innovative technology, easy using, fashion in trend, being highly visible in a room, and robust quality. The marketing set up seven points in each criterion and let the team members to score the product from one to seven. It turned out every criterion of this prototype scored high, the evaluation results were quite satisfying.",
    "In order to make the final evaluation, the team needed to give rating to these products. Of the design of the three fruits, the teams agreed to give two points. As for the trend, since fruits and vegetables were quite populous, the final rating was three. In terms of the company strategy, the rating was one because it perfectly conformed to the strategy. The overall evaluation is around two, which was quite good.",
    "The marketing expert confirmed with the group that the product was aimed at people with age below forty, but it  was also designed for people above forty. The marketing expert also stated that people would need a teletext button because it was originally combined with the menu in the prototype. After that, the marketing expert discussed with the designers to design the prototype with fresh colours so it would be more discoverable when lost. They also agreed on the button numbers and the texture."
  ],
  "157": [
    "Firstly, despite the convenience of left-handed users, symmetrical button design would create extra buttons and hence inevitably confuse users. Also, Project Manager pointed out that left-handed users have no difficulty handling the remote control by either side of hands. User Interface added that a thumb was sufficient for this motion, so no difference should exist between left and right.",
    "Industrial Designer recalled that some acquaintances have left- and right-handed people in the family but they all use the right-handed mouse for the computer. Marketing added that the remote only required pressing buttons and it would not be too hard. However, in the end, they agreed to have both in stock to make them more appealing."
  ]
}